/****************************************************************/
/*  * @file     ppermif.c                                       */
/*  * @brief    許可・設定値調停                                */
/*  * @domain   -                                               */
/*  * @date     2026/08/04 新規作成                             */
/*  *           2026/09/10 pioI/Fの参照へ変更                   */
/*  *                      閾値自動反映修正                     */
/*  * @(c)      2026 ocml                                       */
/****************************************************************/

/****************************************************************/
/*  * SETTING                                                   */
/****************************************************************/
/* ▼▼▼ 以下，設定 ▼▼▼ */
#define phs_PPERM_SHT_CLTH        (30.) /* シフト遷移許可判定用クラッチ開度マクロ     */
#define phs_PPERM_SHT_SPD         (5.)  /* シフト遷移許可判定用スピードマクロ         */
#define phs_PPERM_ACEL_BRKSZ_LIM  (50.) /* ブレーキ焼き付き時アクセル制限設定用マクロ */
#define phs_PPERM_ACEL_OVRV_LIM   (70.) /* オーバーレブ時アクセル制限設定用マクロ     */
#define phs_PPERM_SPD_BRKSZ_LIM   (50.) /* ブレーキ焼き付き時スピード制限設定用マクロ */
/* ▲▲▲ ---------- ▲▲▲ */









