/****************************************************************/
/*  * @file     pprtctif.h                                      */
/*  * @brief    -                                               */
/*  * @domain   -                                               */
/*  * @date     2026/07/26                                      */
/*  * @(c)      2026 ocml                                       */
/****************************************************************/
#ifndef PPRTCTIF_H
#define PPRTCTIF_H

/****************************************************************/
/*  * include                                                   */
/****************************************************************/
#include "../inc/common.h" /* uint8_t等の型定義。他ファイルからのinclude順序に依存しないための自己完結化 */

/****************************************************************/
/*  * external public variables contains macros                 */
/****************************************************************/
extern uint8_t u8gPprtctifOvrvsts;
extern uint8_t u8gPprtctifClthszsts;
extern uint8_t u8gPprtctifBrkszsts;
extern uint8_t u8gPprtctifEnststs;


/****************************************************************/
/*  * external function prototyp                                */
/****************************************************************/
void vdgPprtctifInit( void );
void vdgPprtctif16msin( void );

#endif
/****************************************************************/
/*  * end of file                                               */
/****************************************************************/
